[
  {
    "company": "Trifacta",
    "location": "San Francisco, CA",
    "image": "./trifacta_icon.png",
    "roles": [
      {
        "title": "Software Engineer Coop",
        "dates": "Jan. 2020—Aug. 2020",
        "bullets": [
          "Full-stack development of the role-based access control service at Trifacta with React and Spring, providing resource control and sharing of resources",
          "Developed user and group management pages for Trifacta workspaces",
          "Built cross migration system to maintain data parity between databases"
        ]
      }
    ]
  },
  {
    "company": "Wayfair",
    "location": "Boston, MA",
    "image": "./wayfair_icon.jpg",
    "roles": [
      {
        "title": "Software Engineer Coop",
        "dates": "Jan 2019—Aug. 2019",
        "bullets": [
          "Developer for scalable distributed web scraping platform to gather and clean competitor product and catalog information built off the Scrapy framework",
          "Built spiders and spider middlewares to crawl web pages, APIs, and sitemaps for over a dozen competitors",
          "Prototyped a Flask and React web app to allow stakeholders to monitor spiders and control crawling schedules"
        ]
      }
    ]
  },
  {
    "company": "Khoury College",
    "location": "Boston, MA",
    "image": "./khoury_icon.jpg",
    "roles": [
      {
        "title": "Algorithms & Data Structures TA",
        "dates": "Sept. 2018—Dec. 2018",
        "bullets": [
          "Lead office hours and recitations on how common algorithms and data structures work and how to design and reason about algorithms",
          "Graded homework, assessments, and algorithm implementations in python"
        ]
      },
      {
        "title": "Fundamentals of Computer Science Tutor",
        "dates": "Sept. 2017—Dec. 2017",
        "bullets": [
          "Lead labs and office ours introducing principles of program design",
          "Grading homework modules in Racket, tests, and quizzes"
        ]
      }
    ]
  },
  {
    "company": "Fluid-Screen",
    "location": "Cambridge, MA",
    "image": "./fluid_screen_logo.png",
    "roles": [
      {
        "title": "Software Engineer Coop",
        "dates": "Jan. 2018—Aug. 2018",
        "bullets": [
          "Fullstack developer for Kivy desktop application allowing researchers to configure, run, and analyze lab experiments",
          "Worked with OpenCV computer vision pipeline for analyzing bacterial motion",
          "Developed hardware management API to coordinate various flow systems, high precision cameras, function generators, and oscilloscopes"
        ]
      }
    ]
  }
]